Repository: kirpachov/kirpachov.com_angular
Catalog: src/locale/messages.*.xlf
Languages: it

# PageNotFound
source: Oops! Page not found.
it: Oops! Pagina non trovata.

source: Go to home page
it: Vai alla home page

# AboutPage:MainSection:title
source: Ciao, call me Sasha.
it: Ciao, chiamami Sasha.

# AboutPage:MainSection:p1
source: Sasha is the way everybody calls me, even if it's far away from my official name - Oleksandr - but it's definetly easier.
it: Sasha è il modo in cui tutti mi chiamano, anche se è molto distante dal mio nome ufficiale - Oleksandr - ma è sicuramente più seplice.

# AboutPage:MainSection:p2
source: I was born in Bila Tzerkva, a city 80km south of Kiev, the 16 may 2002.
it: Sono nato in Bila Tzervka, una città a 80km a sud di Kiev, il 16 maggio 2002.

# AboutPage:MainSection:p3
source: I fall in love with development during the third year of computer science in ITIS C.Zuccante, thanks to my computer science teacher.
it: Mi sono innamorato della programmazione durante il terzo anno di informatica all'ITIS C. Zuccante, grazie al mio professore di informatica.

# AboutPage:MainSection:p4
source: From there, my life changed. I started practicing something I actually liked with good results.
it: Da lì, la mia vita cambiò. Iniziai a praticare qualcosa che mi piaceva con risultati discreti.

# AboutPage:MainSection:p5
source: I am constantly searching for new ideas and ways to improve my code and software.
it: Sono sempre alla ricerca di nuove idee e modi per migliorare la qualità del mio codice e dei miei software.

# AboutPage:MainSection:ImageAlt
source: Photo of me
it: Foto di me

# AboutPage:StudiesSection:ImageAlt
source: Image of ITIS C. Zuccante
it: Immagine dell'istituto ITIS C. Zuccante

# AboutPage:StudiesSection:title
source: Studies
it: Studi

# AboutPage:StudiesSection:p1
source: I graduated in Computer Science from the Carlo Zuccante Institute in Mestre Venice. I will start studying Information Science at Ca' Foscari University of Venice in September 2023. The idea is to complete the three-year degree in Information Science and then pursue a master's degree in Computer Security.
it: Mi sono diplomato all'ITIS C. Zuccante di Mestre Venezia in informatica. Inizierò a studiare scienze dell'informazione all'università Ca' Foscari a Settembre 2023. L'idea sarebbe di completare la triennale per poi completare la magistrale in sicurezza informatica.

# AboutPage:WorkSection:title
source: Work
it: Lavoro

# AboutPage:WorkSection:p1
source: I currently work as a web developer at Demetra Opinioni.net Srl since March 2021. However, I started working at a very young age, as I have always been fond of freedom and independence.
it: Attualmente lavoro come sviluppatore web presso Demetra Opinioni.net srl da marzo 2021. Comunque ho iniziato a lavorare molto giovane in quanto sono sempre stato amante della libertà ed indipendenza.

# AboutPage:WorkSection:ImageAlt
source: Demetra Opinioni.net srl logo
it: Logo di Demetra Opinioni.net

# AboutPage:TechSection:title
source: Tech stack
it: Tecnologie conosciute

# AboutPage:TechSection:p1
source: I learned the basics of computer science at ITIS C.Zuccante, a high school for computer science students. During those years, I worked with PHP, mySQL, CSS, JavaScript, HTML, Dart, and some Java. I started working at Demetra Opinioni.net a few months before graduating, and I learned a lot, which I was then able to apply to my final exams. At work, I have also learned Ruby, TypeScript, SCSS, and PostgreSQL. I also know a couple frameworks, such as Ruby on Rails, Angular, Yii, and Flutter
it: Ho appreso le basi dell'informatica all'ITIS C. Zuccante, una scuola superiore per informatici. Durante questi anni ho lavorato con PHP, mySQL, CSS, JavaScript, HTML, Dart, e Java. Ho iniziato a lavorare a Demetra Opinioni.net srl qualche mese prima di diplomarmi, e ho imparato molto, che tra l'altro ho anche portato all'esame di maturità. A lavoro ho poi imparato Ruby, Typescript, SCSS, PostgreSQL. Conosco inoltre qualche framework, come Ruby on Rails, Angular, Yii e Flutter.

# AboutPage:HobbiesSection:title
source: Hobbies and passions
it: Hobby e passioni

# AboutPage:HobbiesSection:p1
source: The truth is that I love doing many things, I'm very open-minded and extremely ambitious. I can briefly mention some of my passions, so as not to bore you.
it: La verità è che amo fare tante cose, sono molto aperto mentalmente ed estremamente ambizioso. Potrei menzionarvi qualcuna delle mie passioni, giusto per non tediarvi.

# AboutPage:HobbiesSection:p2
source: I love cars, motorcycles, and extreme sports. Anything that can give me an adrenaline rush is a hobby of mine. I believe that adrenaline is one of the truest sensations that life can give us.
it: Amo le auto, le moto e gli sport estremi. Qualsiasi cosa mi possa dare adrenalina è un mio hobby. Sono convinto che l'adrenalina sia una delle senzazioni più vere che la vita ci possa regalare.

# AboutPage:HobbiesSection:p3
source: I love animals. I love all animals, and maybe in another life, I would have been a veterinarian. Animals are never fake, they never say one thing and mean another, and they are always genuine and straightforward. I have two cats: Tom, an 8-year-old ginger cat, and Kikka, a 4-year-old Siamese kitten.
it: Amo gli animali. Amo tutti gli animali, e forse in un altra vita sarei stato un veterinario. Gli animali non sono mai falsi, non dicono mai una cosa per un'altra e sono sempre genuini e diretti. Ho due gatti: Tom, un gatto rosso di 8 anni, e Kikka, una gattina siamese di 4.

# AboutPage:HobbiesSection:p4
source: I love learning new things. "Curiosity is everything" is a phrase that I fully endorse. Sometimes, I even get chills when I discover something new thanks to a documentary or a book.
it: Amo imparare cose nuove. "La curiosità è tutto" è una frase che condivido pienamente. Mi capita anche di avere i brividi quando scopro qualcosa di nuovo grazie ad un documentario oppure un libro.

# AboutPage:HobbiesSection:p5
source: I love sports. Sports are a wonderful thing. They allow us to test our skills while doing something that is good for our body and soul. Let's face it, who doesn't feel more relaxed after a good workout? I practiced karate for 4 years, swimming for another 2, and I've been doing bodybuilding since I was 14 years old.
it: Amo lo sport. Lo sport è una cosa meravigliosa. Ci permettono di testare le nostre abilità facendo del bene al nostro corpo e all'anima. Ammettiamolo, chi non si sente meglio dopo un bell'allenamento? Ho praticato karate per 4 anni, nuoto per altri 2 e da quando ho 14 anni mi alleno in sala pesi.

# AboutPage:HobbiesSection:p6
source: I love my family. Okay, maybe it's not a hobby, but I talked about all the things I love, and I couldn't not talk about my family. My mother took me away from my hometown (Bila Tzerkva, Ukraine) when I was 7 years old, to give me a better life here in Italy. Alone, without education, without knowing the language, and with a child to take care of, she managed, after many years of sacrifice, to buy a house that was all ours. There is no woman in the world who is stronger than her. She taught me what sacrifice and hard work are.
it: Amo la mia famiglia. Okay, forse non è un hobby, ma ho parlato di tutto ciò che amo, e non potrei non parlare della mia famiglia. Mia madre mi portò via dalla mia città natale (Bila Tzerkva, Ucraina) quando avevo 7 anni per darmi una vita migliore qui in Italia. Sola, senza istruzione, senza conoscere la lingua e con un bambino a carico, è riuscita dopo anni di sacrifici a comprare una casa tutta nostra. Non esiste donna al mondo che sia più forte di lei. Lei mi ha insegnato cosa sono sacrificio e duro lavoro.

# AboutPage:HobbiesSection:ImageAlt
source: Image of my cats
it: Immagine dei miei gatti

# ContactsPage:WriteMe
source: Write me
it: Scrivimi

# ContactsPage:CallMe
source: Call me
it: Chiamami

# CreditsPage:Title
source: Credits
it: Crediti

# CreditsPage:Description
source: I've developed this website by my own. I've used some cool libraries/frameworks to make everything better & faster.
it: Ho sviluppato questo sito da solo. Comunque, ho utilizzato qualche libreria per rendere lo sviluppo più veloce ed efficiente.

# ProjetsPage:Title
source: Projects
it: Progetti

# ProjectsPage:Description
source: Here you can see some of my projects.
it: Qui puoi vedere qualcuno dei miei progetti

# ProjectsPage:LoadingText
source: Loading projects, just a moment...
it: Caricamento progetti, solo un attimo

# RightNowMoment
source: Now
it: ora

# ContactFormComponent:Title
source: Contact me
it: Contattami

# ContactFormComponent:Description
source: I'll get in touch as soon as possible!
it: Ti contatterò al più presto!

# ContactFormComponent:Form:Fullname
source: Your full name
it: Nome completo

# ContactFormComponent:Form:Email
source: Your work email
it: Email lavorativa

# ContactFormComponent:Form:Message
source: Message
it: Messaggio

# ContactFormComponent:Form:ConfirmButtonText
source: Send message
it: Invia messaggio

# ContactFormConfirm
source: Your request has been sent. I'll contact you as soon as possible.
it: La sua richiesta è stata registrata. La contatterò al più presto.

# ContactFormError
source: An error occurred while sending your request. Please try again later.
it: Un errore si è verificato nell'invio della sua richiesta. Riprovi più tardi.

# HomePage:AboutSection:FindOutMoreButtonLabel
source: Find out more about my work
it: Scopri di più sul mio lavoro

# HomePage:AboutSection:Title
source: Ciao, call me Sasha. I'm a full stack web developer.
it: Ciao, chiamami Sasha. Sono uno sviluppatore web.

# HomePage:AboutSection:Subtitle
source: I'm a young nerd trying to make life easier through quality software.
it: Sono un giovane nerd che cerca di semplificare la vita alle persone attraverso software di qualità

# HomePage:MainSection:Slogan
source: Cutting-edge software for cutting-edge companies.
it: Software all'avanguardia per aziende all'avanguardia.

# HomePage:MainSection:FindOutMore
source: Find out more
it: Scopri di più

# HomePage:MainSection:Rfq
source: Request a quote
it: Richiedi un preventivo

# HomePage:MainSection:ImageAlt
source: Myself working at Demetra Opinioni.net, 2022
it: Io che lavoro presso Demetra Opinioni.net srl, 2022

# HomePage:ProjectsSection:Title
source: Projects
it: Progetti

# HomePage:ProjectsSection:FindOutHowIWork
source: Find out how I work
it: Scopri come lavoro

# HomePage::ServiceSection::Title
source: Service
it: Servizi

# HomePage:ServiceSection:Subtitle
source: My main service is web application development. I do it like this.
it: Il mio servizio principale è lo sviluppo di applicazioni web. Io lo faccio così.

source: Request a quote
it: Richiedi un preventivo

# serviceSectionStep1Title
source: Specifications
it: Specifiche

# serviceSectionStep1Description
source: To solve a problem, it's necessary to understand it thoroughly. It's essential to understand the client's needs before starting with the design. In this phase, the crucial point is communication between the client and the developer.I will also provide you with a detailed quote and timeline.
it: Per risolvere un problema, è necessario prima comprenderlo fino in fondo. È essenziale capire le necessità del cliente prima di iniziare a progettare l'applicazione. In questa fase, il punto cruciale è la comunicazione tra il cliente e lo sviluppatore. In questa fase vi verrà fornito anche un preventivo dettagliato e una data di scadenza.

# serviceSectionStep2Title
source: Design
it: Progettazione

# serviceSectionStep2Description
source: After the project is approved, I will start working on the design. I will provide you with a design mockup and a prototype.
it: Dopo che il progetto è stato approvato, inizierò a lavorare alla progettazione. Vi verranno forniti degli esempi grafici e logici.

# serviceSectionStep3Title
source: Development
it: Sviluppo

# serviceSectionStep3Description
source: After the design is approved, I will start working on the development. I will provide you periodic updates of the development with some screenshots and prototypes of the app.
it: Dopo che gli esempi forniti risultano andare bene, inzierò effettivamente a sviluppare l'applicazione. Vi fornirò aggiornamenti periodici dello sviluppo, con tanto di esempi logici e screenshot.

# serviceSectionStep4Title
source: Deployment
it: Produzione

# serviceSectionStep4Description
source: Once the development process is completed, and then we move on to the publication of the application. After this phase, the application will be online, and the client will be able to use it to its full potential.
it: Dopo che lo sviluppo è stato completato, procederò a sviluppare l'applicazione. Terminata questa fase l'applicazione sarà online e utilizzabile al 100%.

# serviceSectionStep5Title
source: Support
it: Assistenza

# serviceSectionStep5Description
source: Guaranteed support. Any issue with the application or the server it relies on is my responsibility. Free regular maintenance for the first 12 months after the application is delivered.
it: Assistenza garantita. Qualsiasi problema dall'applicazione o del server è a carico mio. Assistenza ordinaria gratuita per i primi 12 mesi dalla consegna dell'applicazione.

# ProjectCardComponent:More
source: More
it: Di più

# PublicWrapperComponent:PublicFooter:CreatedBy
source: Created by
it: Creato da

# PublicNavbar:Link:Projects
source: Projects
it: Progetti

# PublicNavbar:Link:ContactMe
source: Contact me
it: Contattami

# PublicNavbar:MobileLink:Projects
source: Projects
it: Progetti

# PublicNavbar:MobileLink:ContactMe
source: Contact me
it: Contattami
